[{"name": "purpose_1", 
   "alias": "Ceasefire Purpose", 
   "description": "This variable shows the primary motivation behind each ceasefire.  We distinguish between ceasefires that relate to elections, religious holidays, humanitarian efforts and peace processes."},
{"name": "mediator_nego",
   "alias": "Mediation",
   "description": "This variable shows whether or not we find evidence of that a ceasefire was developed with the assistance of a third-party mediator. Mediating parties can include individuals, states and NGOs." },
{"name": "implement",
   "alias": "Agreed Mechanism",
   "description": "This variable shows whether or not we find any evidence that a ceasefire includes an implementation mechanism. Possible implementation mechanisms are provisions for monitoring, verification, separation of forces, a complaint mechanism, or the establishment of a working committee.  Importantly, the variable shows the agreed-upon mechanism, and does not show whether or not the mechanism was actually implemented."},
{"name": "enforcement",
   "alias": "External Enforcement",
   "description": "This variable shows whether or not an external actor, either a State or an NGO, enforced the ceasefire using military forces. NGO enforcement includes UN peace-keeping missions, while State enforcement shows state intervention to establish a ceasefire."},
{"name": "written",
   "alias": "Written Agreement",
   "description": "This variable shows whether or not we find evidence that a ceasefire was codified in a written agreement between the parties. If we do not find clear evidence we assume that it was an informal ceasefire established verbally or otherwise."},
{"name": "ceasefire_type",
   "alias":"Comprehensiveness",
   "description": "This variable discerns between definitive and preliminary ceasefires. A ceasefire is defined as definitive if the conflict-driving incompatibility between the parties is addressed and the conflict is decisively ended.  Importantly, the variable shows the declared intention of the ceasefire. Ceasefires that were intended as definitive are therefore marked as definitive, even if the conflict continues."}]
